[
  {
    "disease": "Anterior Cruciate Ligament (ACL) Tear",
    "mechanism_of_injury": "Sudden deceleration, pivoting or landing awkwardly from a jump, especially in sports like football, basketball, and skiing."
  },
  {
    "disease": "Achilles Tendon Rupture",
    "mechanism_of_injury": "Forceful push-off or sudden acceleration while running or jumping."
  },
  {
    "disease": "Rotator Cuff Tear",
    "mechanism_of_injury": "Overuse from repetitive overhead activities (e.g., swimming, tennis) or acute trauma such as falling on an outstretched arm."
  },
  {
    "disease": "Concussion",
    "mechanism_of_injury": "Direct blow to the head or whiplash injury causing rapid acceleration-deceleration of the brain."
  },
  {
    "disease": "Lateral Epicondylitis (Tennis Elbow)",
    "mechanism_of_injury": "Repetitive wrist extension and forearm supination, common in racquet sports and repetitive manual labor."
  },
  {
    "disease": "Medial Collateral Ligament (MCL) Injury",
    "mechanism_of_injury": "Direct blow to the outside of the knee while the foot is planted, causing inward stress on the knee joint."
  },
  {
    "disease": "Patellar Tendinopathy (Jumper’s Knee)",
    "mechanism_of_injury": "Repetitive jumping or explosive leg movements common in basketball, volleyball, and track."
  },
  {
    "disease": "Shin Splints (Medial Tibial Stress Syndrome)",
    "mechanism_of_injury": "Overuse from repetitive impact on hard surfaces, often seen in runners and military recruits."
  },
  {
    "disease": "Hamstring Strain",
    "mechanism_of_injury": "Sudden acceleration or deceleration, especially in sports like sprinting and football."
  },
  {
    "disease": "Shoulder Dislocation",
    "mechanism_of_injury": "Fall on outstretched arm or direct blow to shoulder during contact sports."
  },
  {
    "disease": "Meniscal Tear",
    "mechanism_of_injury": "Twisting or turning quickly, often with the foot planted and knee bent during sports like soccer or basketball."
  },
  {
    "disease": "Plantar Fasciitis",
    "mechanism_of_injury": "Repetitive strain from running, jumping, or standing for prolonged periods; common in runners and athletes with poor foot biomechanics."
  },
  {
    "disease": "Groin Strain",
    "mechanism_of_injury": "Forceful adduction or sudden changes in direction while running or kicking, typical in football and hockey."
  },
  {
    "disease": "Stress Fracture of Tibia",
    "mechanism_of_injury": "Repetitive impact and overuse, particularly in long-distance runners or dancers."
  },
  {
    "disease": "Acromioclavicular (AC) Joint Sprain",
    "mechanism_of_injury": "Fall directly onto the shoulder or collision in contact sports like rugby or hockey."
  },
  {
    "disease": "Quadriceps Contusion",
    "mechanism_of_injury": "Direct blow to the thigh during contact sports such as football or rugby."
  },
  {
    "disease": "Calcaneal Stress Fracture",
    "mechanism_of_injury": "Overuse injury from repetitive heel impact, especially in long-distance runners or soldiers."
  },
  {
    "disease": "Labral Tear of the Hip",
    "mechanism_of_injury": "Repetitive hip flexion and rotation as seen in dancers, footballers, or hockey players."
  },
  {
    "disease": "Ulnar Collateral Ligament (UCL) Injury of the Elbow",
    "mechanism_of_injury": "Repetitive overhead throwing motions, common in baseball pitchers and javelin throwers."
  },
  {
    "disease": "Compartment Syndrome (Exertional)",
    "mechanism_of_injury": "Increased pressure in a muscle compartment due to repetitive exercise, especially running."
  },
  {
    "disease": "Biceps Tendon Rupture",
    "mechanism_of_injury": "Sudden heavy lifting or eccentric load during weight training or contact sports."
  },
  {
    "disease": "Hip Pointer",
    "mechanism_of_injury": "Direct blow to the iliac crest from a fall or collision, common in football, hockey, and basketball."
  },
  {
    "disease": "Thoracic Outlet Syndrome",
    "mechanism_of_injury": "Compression from repetitive overhead activities, common in swimmers and baseball pitchers."
  },
  {
    "disease": "Turf Toe",
    "mechanism_of_injury": "Hyperextension of the big toe from pushing off on artificial turf, especially in football and soccer."
  },
  {
    "disease": "Costochondritis",
    "mechanism_of_injury": "Repetitive upper body motion or blunt trauma to the chest during intense physical activity or contact sports."
  },
  {
    "disease": "Scaphoid Fracture",
    "mechanism_of_injury": "Fall on an outstretched hand during sports like skating, snowboarding, or cycling."
  },
  {
    "disease": "Snapping Hip Syndrome",
    "mechanism_of_injury": "Overuse and repetitive hip flexion, often seen in dancers, runners, and gymnasts."
  },
  {
    "disease": "Baker's Cyst Rupture",
    "mechanism_of_injury": "Often associated with underlying knee pathology and aggravated by repetitive knee flexion or trauma."
  },
  {
    "disease": "Clavicle Fracture",
    "mechanism_of_injury": "Fall onto shoulder or outstretched arm during contact sports like rugby or mountain biking."
  },
  {
    "disease": "Patellar Dislocation",
    "mechanism_of_injury": "Twisting motion with a planted foot or direct blow to the knee, especially in adolescents and athletes in pivoting sports."
  },
  {
    "disease": "Posterior Cruciate Ligament (PCL) Injury",
    "mechanism_of_injury": "Direct blow to the front of the tibia with a flexed knee, common in car accidents or falling onto a bent knee during sports."
  },
  {
    "disease": "Deltoid Ligament Sprain (Ankle)",
    "mechanism_of_injury": "Forced eversion of the foot during sports like soccer or basketball."
  },
  {
    "disease": "Iliotibial Band Syndrome",
    "mechanism_of_injury": "Overuse injury caused by repetitive knee flexion/extension, especially in runners and cyclists."
  },
  {
    "disease": "Cervical Whiplash Injury",
    "mechanism_of_injury": "Sudden acceleration-deceleration of the neck, typically from collisions in contact sports or falls."
  },
  {
    "disease": "Olecranon Bursitis",
    "mechanism_of_injury": "Direct trauma or prolonged pressure on the elbow, seen in wrestling, weightlifting, or gymnastics."
  },
  {
    "disease": "Extensor Tendon Injury of the Hand",
    "mechanism_of_injury": "Laceration or forceful trauma to the dorsum of the hand during sports like martial arts or rugby."
  },
  {
    "disease": "Peroneal Tendon Subluxation",
    "mechanism_of_injury": "Sudden dorsiflexion and eversion of the ankle, common in skiing, basketball, and soccer."
  },
  {
    "disease": "Pubic Symphysis Dysfunction (Athletic Pubalgia)",
    "mechanism_of_injury": "Chronic stress to the pelvis from twisting, cutting, or pivoting motions, often in soccer and hockey."
  },
  {
    "disease": "Spinal Disc Herniation",
    "mechanism_of_injury": "Repetitive axial loading and flexion, common in weightlifting, wrestling, and gymnastics."
  },
  {
    "disease": "Radial Head Subluxation (Nursemaid's Elbow)",
    "mechanism_of_injury": "Sudden pulling of the forearm, more common in young children but may occur during certain martial arts or gymnastic maneuvers."
  }
]